package homework;

public class Prac1_1_34 {
    /**
     *过滤。以下哪些任务需要（在数组中，比如）
     * (1)保存标准输入中的所有值？哪些可以
     * (2)被实现为一个过滤器且仅使用固定数量的变量和固定大小的数组（和N无关）？
     * 在每个问题中，输入都来自于标准输入且含有N个0到1的实数。
     *
     * 　　打印出最大和最小的数                      (2)
     * 　　打印出所有数的中位数 　　                  (1)
     * 　　打印出第 k 小的数，k 小于100              (2)
     * 　　打印出所有数的平方和                      (2)
     * 　　打印出 N 数的平均值                      (2)
     * 　　打印出大于平均值的数的百分比               (1)
     * 　　将 N 个数按照升序打印                    (1)
     * 　　将 N 个数按照随机顺序打印                 (1)
     */
}
